{
    "session10": {
        "link": "http://www.meetup.com/Geneva-MongoDB-User-Group/events/167080442/",
        "auth_link": "http://www.meetup.com/Geneva-MongoDB-User-Group/members/121402742/",
        "date_fr": "Mardi 18 Mars 2014, 19:15 à 19:55, à l'HEPIA (Salle A106)",
        "title_fr": "MongoDB's Aggregation Framework",
        "desc_fr": "The aggregation framework was introduced in version 2.2, providing a great alternative to MapReduce. During this talk, we will demonstrate and explain its basic operators with some examples and live demos. We will also have a look at its evolution in 2.5 and beyond.",
        "author_pic": "./img/speakers/alain_helaili.jpg",
        "author_fr": "Alain is a solution architect at MongoDB based in Paris.  He has been working with Java since 1997 in several companies including BEA Systems and dynaTrace. Alain loves playing golf although he spends more time looking for his lost balls than actually playing."
    },

    "session9": {
        "link": "http://www.meetup.com/Geneva-MongoDB-User-Group/events/167079532/",
        "auth_link": "http://www.meetup.com/Geneva-MongoDB-User-Group/members/112130262/",
        "date_fr": "Mardi 18 Mars 2014, 18:30 à 19:10, à l'HEPIA (Salle A106)",
        "title_fr": "Efficient Partial and Fuzzy Matching with MongoDB",
        "desc_fr": "John will talk about four efficient  ways you can use MongoDB to find information where the search attributes you have and the recorded data don't exactly match and you need to find the best matches. This is primarily focussed on names and identity details.",
        "author_pic": "./img/speakers/john_page.jpg",
        "author_fr": "John spent the last 18 years at Memex (Later SAS Public Security) building Custom NoSQL database technologies and applications for the Intelligence Community in the US, UK and Middle east - he specialises in helping track down bad people and stopping them."
    },

    "session8": {
        "link": "http://www.meetup.com/Geneva-MongoDB-User-Group/events/159149942/",
        "auth_link": "http://www.meetup.com/Geneva-MongoDB-User-Group/members/81587272/",
        "date_fr": "Mercredi 22 Janvier 2014, 16:00 à 18:30, à Geneva Business Center, Avenue des Morgines 12, Genève (salle Munich)",
        "title_fr": "Hands-on Workshop: Building RESTful CRUD services with MongoDB and Java",
        "desc_fr": "REQUIREMENTS: This workshop is a follow up of the talk <a href='http://www.meetup.com/Geneva-MongoDB-User-Group/events/159149332/'> 'Jongo - Querying MongoDB from Java' (21.01.2014 @ 18h30)</a>. Access to the workshop is free and places are limited. Please, subscribe only if you are certain that you will come. If you choose to come, bring your laptop with pre-installed: Java6 +, MongoDB, Git, Eclipse or IntelliJ. Description: The workshop will take you through basic examples of using MongoDB with Jongo and building simple RESTful CRUD operations on top of it.",
        "author_pic": "./img/speakers/ivan_hristov.jpg",
        "author_fr": "A software engineer by day, Ivan is also an open-source committer and GenevaMUG organizer. Twitter: @iv_hristov. Blog: http://ingini.org/"
    },

    "session7": {
        "link": "http://www.meetup.com/Geneva-MongoDB-User-Group/events/159149332/",
        "auth_link": "http://www.meetup.com/Geneva-MongoDB-User-Group/members/81587272/",
        "date_fr": "Mardi 21 Janvier 2014, 18:30 à 20:00, à l'HEPIA (Salle A502)",
        "title_fr": "Jongo - Querying MongoDB from Java",
        "desc_fr": "This talk is designed for people interested in getting to know MongoDB and how they can use it from Java. Come and learn about <a href='http://jongo.org/'>Jongo</a> and how you can use this Java-based library to query MongoDB without much of a fuss. In addition, we will see some basic comparison between <a href='https://github.com/mongodb/morphia'> Morphia </a>, <a href='http://projects.spring.io/spring-data-mongodb/'>Spring Data MongoDB</a> and <a href='http://jongo.org/'>Jongo</a>.",
        "author_pic": "./img/speakers/ivan_hristov.jpg",
        "author_fr": "A software engineer by day, Ivan is also an open-source committer and GenevaMUG organizer. Twitter: @iv_hristov. Blog: http://ingini.org/"
    },

    "session6": {
        "link": "http://www.meetup.com/Geneva-MongoDB-User-Group/events/155758742/",
        "auth_link": "http://www.meetup.com/Geneva-MongoDB-User-Group/members/17782821/",
        "date_fr": "Mercredi 22 Janvier 2014, 16:00 à 18:30, à Geneva Business Center, Avenue des Morgines 12, Genève (salle Munich)",
        "title_fr": "<font color='red'> Event is CANCELLED</font> Hands-on Workshop: Building an Online-Recommendation Engine with MongoDB",
        "desc_fr": "REQUIREMENTS: This workshop is a follow up of the talk <a href='http://www.meetup.com/Geneva-MongoDB-User-Group/events/155750342/'> 'Building an Online-Recommendation Engine with MongoDB' (21.01.2014 @ 18h30)</a>. Access to the workshop is free and places are limited. Please, subscribe only if you are certain that you will come. If you choose to come, bring your laptop with pre-installed: Java6 +, MongoDB, Git, Eclipse or IntelliJ. Description: Mario is an Italian guy who sells the most famous pizza in Munich through an online shop based on MongoDB. Mario's current goal is to increase his cross- and up-selling rate. He hired a statistician to create a recommendation engine for the online shop. This talk sheds light on how to build an online recommendation engine based on MongoDB and Apache Mahout. We show which recommenders must be built to reach Mario's goal and how these can be integrated in Mario's shop infrastructure. Finally, the effectiveness of the different recommenders is visualised in a realtime dashboard.",
        "author_pic": "./img/speakers/bernd_zuther.jpg",
        "author_fr": "Researcher and Software Engineer at comSysto GmbH. Hadoop, MongoDB and Spring JEE Developer. On a permanent quest for cutting edge data management technologies. Twitter: @Bernd_Z ; Web: http://bernd-zuther.de/"
    },

    "session5": {
        "link": "http://www.meetup.com/Geneva-MongoDB-User-Group/events/155750342/",
        "auth_link": "http://www.meetup.com/Geneva-MongoDB-User-Group/members/17782821/",
        "date_fr": "Mardi 21 Janvier 2014, 18:30 à 20:00, à l'HEPIA (Salle A502)",
        "title_fr": "<font color='red'> Event is CANCELLED</font>Building an Online-Recommendation Engine with MongoDB",
        "desc_fr": "Mario is an Italian guy who sells the most famous pizza in Munich through an online shop based on MongoDB. Mario's current goal is to increase his cross- and up-selling rate. He hired a statistician to create a recommendation engine for the online shop. This talk sheds light on how to build an online recommendation engine based on MongoDB and Apache Mahout. We show which recommenders must be built to reach Mario's goal and how these can be integrated in Mario's shop infrastructure. Finally, the effectiveness of the different recommenders is visualised in a realtime dashboard.",
        "author_pic": "./img/speakers/bernd_zuther.jpg",
        "author_fr": "Researcher and Software Engineer at comSysto GmbH. Hadoop, MongoDB and Spring JEE Developer. On a permanent quest for cutting edge data management technologies. Twitter: @Bernd_Z ; Web: http://bernd-zuther.de/"
    },

    "session4": {
        "link": "http://www.meetup.com/Geneva-MongoDB-User-Group/events/146641332/",
        "auth_link": "http://www.meetup.com/Geneva-MongoDB-User-Group/members/8323210/",
        "date_fr": "Mardi 19 Novembre 2013, 18:30 à 20:00, à l'HEPIA (Salle A106)",
        "title_fr": "MongoDB for JPA Developers",
        "desc_fr": "MongoDB is getting a lot of attention these days and many are looking at integrating MongoDB into their systems. For those of us who have spent years in Java EE, that transition can feel daunting. This presentation begins with a basic introduction to MongoDB and how data is organized. It covers several options for getting data in and out of MongoDB: it will cover a few examples of using the Java driver directly but will focus primarily on the Morphia Object Document Mapper. It also explores how MongoDB’s paradigm can affect your object model.",
        "author_pic": "./img/speakers/justin_lee.jpg",
        "author_fr": "Justin has been a Java developer since 1996. Since then he has had the chance to work on wide variety of concerns including everything from web front ends to custom ORM frameworks to helping define standards around websockets. He currently works as a software engineer for mongodb.com. He's an active member of the open source community and blogs less frequently than he intends at http://antwerkz.com."
    },

    "session3": {
        "link": "http://www.meetup.com/Geneva-MongoDB-User-Group/events/137764672/",
        "auth_link": "http://www.meetup.com/Geneva-MongoDB-User-Group/members/34418362/",
        "date_fr": "Mercredi 18 Septembre 2013, 18:30 à 20:00, à l'HEPIA (Salle A106)",
        "title_fr": "Marconi: Queuing and Notification service backed by MongoDB",
        "desc_fr": "Marconi is a multi-tenant cloud queuing system written in Python as part of the OpenStack project. As message bus, it’s main goals are: performance, availability, durability, fault-tolerance and scalability. This talk aims to give the audience as much information as possible about Marconi’s architecture, design, patterns, performance, issues it faced, how its MongoDB backend works and how / why it was built from scratch.",
        "author_pic": "./img/speakers/flavio_mongo-200x300.jpg",
        "author_fr": "Flavio spends most of his time hacking on storage (Glance [core member], Cinder), Oslo (Core member) and Marconi (core member) modules. He has both Italian and Venezuelan roots, and is currently based in Italy where he works remotely for Red Hat. Flavio is also an actively open-source contributor and part of Mongodb Masters group. Twitter (@flaper87), GH (@flaper87) and blog http://www.flaper87.com"
    },

    "session2": {
        "link": "http://www.meetup.com/Geneva-MongoDB-User-Group/events/121571832/",
        "auth_link": "http://www.meetup.com/Geneva-MongoDB-User-Group/members/24573302/",
        "date_fr": "Mardi 11 Juin 2013, 18:30 à 20:00, à l'HEPIA (Salle A106)",
        "title_fr": "JSONiq - The SQL of NoSQL",
        "desc_fr": "JSONiq is a high-level query language that enables developers to productively develop and execute complex queries on top of MongoDB.<br/>This is not your grandma’s SQL. <br/>JSONiq supports novel concepts purposely designed for unstructured, deeply nested, and horizontally deployed JSON data. <br/>It supports complex query processing features such as joins, grouping, transformation, full-text, or updates without giving up on scalability.<br/> <br/>Presentation will be in English, questions can be asked in French and in English <br/> <br/> La présentation se déroulera en anglais, les questions pourront être posées en anglais et en français.",
        "author_pic": "http://m.c.lnkd.licdn.com/mpr/mpr/shrink_80_80/p/5/000/270/03c/0b2e7d5.jpg",
        "author_fr": "William Candillon is a software engineer at 28.io. <br/>His focus is on the development of complex query processing using JSONiq. <br/>William Candillon holds a Master of Science from Telecom Lille, France.<br/>His master thesis was exploring the existence of design patterns in query languages."
    },

    "session1": {
        "link": "http://www.meetup.com/Geneva-MongoDB-User-Group/events/113249882/",
        "auth_link": "http://www.meetup.com/Geneva-MongoDB-User-Group/members/32194192/",
        "date_fr": "Mardi 23 Avril 2013, 18:30 à 20:00, à l'HEPIA (Salle A106)",
        "title_fr": "Mongo 101",
        "desc_fr": "Maxime nous présentera MongoDB pour les personnes désirant en savoir plus sur cette base de donnée NoSQL orienté document.<br/><br/>Il abordera très brièvement ce qu'est une base de donnée NoSQL, ses différences avec une base de donnée relationnel (comme Oracle, MySQL, ...) ainsi que les différents types de base de données NoSQL.<br/><br/>Il nous présentera MongoDB en détaillant les différents usages de MongoDB (documents, GridFS, GIS, Aggregation Framework, ...).<br/><br/>Maxime nous fera une petite démonstration d'utilisation du shell MongoDB ainsi qu'un bref retour d'expérience.<br/><br/>Cette session s'adresse essentiellement à des personnes désirant avoir un aperçu de MongoDB et quels avantages cette base peut leur apporter.<br/>La présentation se déroulera en français mais les questions pourront être posées en anglais et en français.",
        "author_pic": "http://photos4.meetupstatic.com/photos/member/7/a/0/a/thumb_32851242.jpeg",
        "author_fr": "Maxime est consultant chez Hortis en tant que Java / Web développeur. Il programme essentiellement en Java (pour la partie Backend) et JavaScript (pour le frontend). <br/><br/>Il montre un intérêt particulier pour les bases NoSQL et utilise MongoDB sur son projet principal. <br/><br/>Maxime est intéressé à la programmation dans son ensemble, les différents langages (beaucoup tournant sur la JVM), l'amélioration continue et est un partisan du TDD.<br/><br/>Maxime adore participer et organiser des évènements autour du métier de développeur. Il est notamment très impliqué dans le GenevaJUG, a animé des coding-dojos, et a également organisé par le passé l'Agile tour Genève, Soft-Shake."
    }

}